In [1]:
import pandas as pd

In [2]:
# Aggregation and Reduction

In [6]:
titanic = pd.read_csv("./datasets/titanic_kaggle.csv")

In [7]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [11]:
titanic.groupby('Pclass').count()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

In [17]:
titanic.groupby(['Pclass']).count()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

In [55]:
life = pd.read_csv("./datasets/life_expectancy_years.csv", 
                   index_col = 'country')

In [53]:
# life.drop('country', axis = 'columns', inplace=True)

In [56]:
regions = pd.read_csv("./datasets/regions.csv", index_col = 'Country')

In [57]:
regions.head()

                                 region
Country
Afghanistan                  South Asia
Albania           Europe & Central Asia
Algeria      Middle East & North Africa
Andorra           Europe & Central Asia
Angola               Sub-Saharan Africa

In [58]:
regions['region']

Country
Afghanistan                    South Asia
Albania             Europe & Central Asia
Algeria        Middle East & North Africa
Andorra             Europe & Central Asia
Angola                 Sub-Saharan Africa
                          ...
Vietnam               East Asia & Pacific
Yemen          Middle East & North Africa
Zambia                 Sub-Saharan Africa
Zimbabwe               Sub-Saharan Africa
South Sudan            Sub-Saharan Africa
Name: region, Length: 197, dtype: object

In [59]:
life.groupby(regions['region'])['2010'].mean()

region
East Asia & Pacific           70.640741
Europe & Central Asia         76.353061
Latin America & Caribbean     73.250000
Middle East & North Africa    74.933333
North America                 80.000000
South Asia                    68.850000
Sub-Saharan Africa            59.483333
Name: 2010, dtype: float64

In [60]:
sales = pd.read_csv("./datasets/sales.csv")